Gyanano/LLM_Assistant/sdkconfig.defaults
# This file was generated using idf.py save-defconfig. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF)  Project Minimal Configuration
#
CONFIG_IDF_TARGET="esp32c3"
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_ESP_WIFI_SSID="Gyan"
CONFIG_ESP_WIFI_PASSWORD="zaxc162405."
CONFIG_BAIDU_ACCESS_KEY="CaaAnOoPUh6akisWmbWZfjqB"
CONFIG_BAIDU_SECRET_KEY="wJkVUQKUaDtFVB0J2LdzwqkJNgcMOFWG"
CONFIG_AUDIO_BOARD_CUSTOM=y
CONFIG_FREERTOS_ENABLE_BACKWARD_COMPATIBILITY=y
CONFIG_ESP_TLS_INSECURE=y
CONFIG_ESP_TLS_SKIP_SERVER_CERT_VERIFY=y
